In [1]:
import numpy as np 
import pandas as pd

In [2]:
Employee = pd.read_excel("Emplyee.xlsx")

In [5]:
# Select * from Employee
Employee

    emp_id  emp_name   job_name  manger_id   hire_date  salary  commision
0    68319   KAYLING  PRESIDENT        NaN  1991-11-18    6000        NaN
1    66928     BLAZE    MANAGER    68319.0  1991-05-01    2750        NaN
2    67832     CLARE    MANAGER    68319.0  1991-06-09    2550        NaN
3    65646     JONAS    MANAGER    68319.0  1991-04-02    2957        NaN
4    67858   SCARLET    ANALYST    65646.0  1997-04-19    3100        NaN
5    69062     FRANK    ANALYST    65646.0  1991-12-03    3100        NaN
6    63679  SANDRINE      CLERK    69062.0  1990-12-18     900        NaN
7    64989    ADELYN   SALESMAN    66928.0  1991-02-20    1700      400.0
8    65271      WADE   SALESMAN    66928.0  1991-02-22    1350      600.0
9    66564    MADDEN   SALESMAN    66928.0  1991-09-28    1350     1500.0
10   68454    TUCKER   SALESMAN    66928.0  1991-09-08    1600        0.0
11   68736    ADNRES      CLERK    67858.0  1997-05-23    1200        NaN
12   69000    JULIUS      CLERK    66928.0  1991-12-03    1050        NaN
13   69324    MARKER      CLERK    67832.0  1992-01-23    1400        NaN

In [6]:
# Describe Table  --- Structure of Table  for example - Describe Employee
Employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_id     14 non-null     int64
 1   emp_name   14 non-null     object
 2   job_name   14 non-null     object
 3   manger_id  13 non-null     float64
 4   hire_date  14 non-null     object
 5   salary     14 non-null     int64
 6   commision  4 non-null      float64
dtypes: float64(2), int64(2), object(3)
memory usage: 916.0+ bytes

In [7]:
# DML - Data Manipulation Language - Select, Where, Order by ,Group by, Comparison Operation , Aggreation Function
# String Operation , Date Function , Math Function 

# 2 . Return Salary
# Select salary from employee
Employee["salary"]

0     6000
1     2750
2     2550
3     2957
4     3100
5     3100
6      900
7     1700
8     1350
9     1350
10    1600
11    1200
12    1050
13    1400
Name: salary, dtype: int64

In [8]:
# Unique Job_nmae
Employee["job_name"].unique()

array(['PRESIDENT', 'MANAGER', 'ANALYST', 'CLERK', 'SALESMAN'],
      dtype=object)

In [33]:
#  Question -4
#copy 
emp_copy = Employee[["emp_name","salary"]]

In [34]:
emp_copy["salary"] = emp_copy["salary"] + 0.15 * emp_copy["salary"]

/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/3747384176.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp_copy["salary"] = emp_copy["salary"] + 0.15 * emp_copy["salary"]

In [35]:
emp_copy

    emp_name   salary
0    KAYLING  6900.00
1      BLAZE  3162.50
2      CLARE  2932.50
3      JONAS  3400.55
4    SCARLET  3565.00
5      FRANK  3565.00
6   SANDRINE  1035.00
7     ADELYN  1955.00
8       WADE  1552.50
9     MADDEN  1552.50
10    TUCKER  1840.00
11    ADNRES  1380.00
12    JULIUS  1207.50
13    MARKER  1610.00

In [36]:
# emp_copy["salary"] =emp_copy["salary"].astype("str")

In [37]:
emp_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   emp_name  14 non-null     object
 1   salary    14 non-null     float64
dtypes: float64(1), object(1)
memory usage: 356.0+ bytes

In [39]:
for i in range(len(emp_copy["salary"])):
    emp_copy["salary"][i] = "$" + str(emp_copy["salary"][i])

/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/2503607402.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  emp_copy["salary"][i] = "$" + str(emp_copy["salary"][i])
/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/2503607402.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp_copy["salary"][i] = "$" + str(emp_copy["salary"][i])
/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/2503607402.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '$6900.0' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  emp_copy["salary"][i] = "$" + str(emp_copy["salary"][i])

In [40]:
emp_copy

    emp_name    salary
0    KAYLING   $6900.0
1      BLAZE   $3162.5
2      CLARE   $2932.5
3      JONAS  $3400.55
4    SCARLET   $3565.0
5      FRANK   $3565.0
6   SANDRINE   $1035.0
7     ADELYN   $1955.0
8       WADE   $1552.5
9     MADDEN   $1552.5
10    TUCKER   $1840.0
11    ADNRES   $1380.0
12    JULIUS   $1207.5
13    MARKER   $1610.0

In [42]:
emp_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   emp_name  14 non-null     object
 1   salary    14 non-null     object
dtypes: object(2)
memory usage: 356.0+ bytes

In [43]:
# QUESTION -5
emp_copy2= Employee[["emp_name","job_name"]]

In [45]:
emp_copy2["Employee & job"] = emp_copy2["emp_name"] +" "+ emp_copy2["job_name"]

/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/405757018.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp_copy2["Employee & job"] = emp_copy2["emp_name"] +" "+ emp_copy2["job_name"]

In [46]:
emp_copy2["Employee & job"]

0     KAYLING PRESIDENT
1         BLAZE MANAGER
2         CLARE MANAGER
3         JONAS MANAGER
4       SCARLET ANALYST
5         FRANK ANALYST
6        SANDRINE CLERK
7       ADELYN SALESMAN
8         WADE SALESMAN
9       MADDEN SALESMAN
10      TUCKER SALESMAN
11         ADNRES CLERK
12         JULIUS CLERK
13         MARKER CLERK
Name: Employee & job, dtype: object

In [49]:
emp_copy2["Employee"] = emp_copy2["emp_name"] +"("+emp_copy2["job_name"].str.lower()+")"

/var/folders/dy/q69lm6yx7cg8tqqkmwwbbzmm0000gn/T/ipykernel_1951/2410337798.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp_copy2["Employee"] = emp_copy2["emp_name"] +"("+emp_copy2["job_name"].str.lower()+")"

In [50]:
emp_copy2["Employee"]

0     KAYLING(president)
1         BLAZE(manager)
2         CLARE(manager)
3         JONAS(manager)
4       SCARLET(analyst)
5         FRANK(analyst)
6        SANDRINE(clerk)
7       ADELYN(salesman)
8         WADE(salesman)
9       MADDEN(salesman)
10      TUCKER(salesman)
11         ADNRES(clerk)
12         JULIUS(clerk)
13         MARKER(clerk)
Name: Employee, dtype: object

In [51]:
# Question 7
copy7 = Employee

In [52]:
copy7

    emp_id  emp_name   job_name  manger_id   hire_date  salary  commision
0    68319   KAYLING  PRESIDENT        NaN  1991-11-18    6000        NaN
1    66928     BLAZE    MANAGER    68319.0  1991-05-01    2750        NaN
2    67832     CLARE    MANAGER    68319.0  1991-06-09    2550        NaN
3    65646     JONAS    MANAGER    68319.0  1991-04-02    2957        NaN
4    67858   SCARLET    ANALYST    65646.0  1997-04-19    3100        NaN
5    69062     FRANK    ANALYST    65646.0  1991-12-03    3100        NaN
6    63679  SANDRINE      CLERK    69062.0  1990-12-18     900        NaN
7    64989    ADELYN   SALESMAN    66928.0  1991-02-20    1700      400.0
8    65271      WADE   SALESMAN    66928.0  1991-02-22    1350      600.0
9    66564    MADDEN   SALESMAN    66928.0  1991-09-28    1350     1500.0
10   68454    TUCKER   SALESMAN    66928.0  1991-09-08    1600        0.0
11   68736    ADNRES      CLERK    67858.0  1997-05-23    1200        NaN
12   69000    JULIUS      CLERK    66928.0  1991-12-03    1050        NaN
13   69324    MARKER      CLERK    67832.0  1992-01-23    1400        NaN

In [53]:
copy7["hire_date"] = pd.to_datetime(copy7["hire_date"])

In [54]:
copy7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_id     14 non-null     int64
 1   emp_name   14 non-null     object
 2   job_name   14 non-null     object
 3   manger_id  13 non-null     float64
 4   hire_date  14 non-null     datetime64[ns]
 5   salary     14 non-null     int64
 6   commision  4 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 916.0+ bytes

In [55]:
copy7["month"]=copy7["hire_date"].dt.month_name()

In [66]:
copy7["day"] = copy7["hire_date"].dt.day
copy7["day"] = copy7["day"].astype('str')

In [67]:
copy7["year"] = copy7["hire_date"].dt.year
copy7["year"] = copy7["year"].astype('str')
copy7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_id     14 non-null     int64
 1   emp_name   14 non-null     object
 2   job_name   14 non-null     object
 3   manger_id  13 non-null     float64
 4   hire_date  14 non-null     datetime64[ns]
 5   salary     14 non-null     int64
 6   commision  4 non-null      float64
 7   month      14 non-null     object
 8   day        14 non-null     object
 9   year       14 non-null     object
 10  Date       14 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(2), object(6)
memory usage: 1.3+ KB

In [68]:
copy7["Date"] = copy7["month"] + " "+ copy7["day"]+" "+  copy7["year"]

In [69]:
copy7["Date"]

0      November 18 1991
1            May 1 1991
2           June 9 1991
3          April 2 1991
4         April 19 1997
5       December 3 1991
6      December 18 1990
7      February 20 1991
8      February 22 1991
9     September 28 1991
10     September 8 1991
11          May 23 1997
12      December 3 1991
13      January 23 1992
Name: Date, dtype: object